# 판다스 기초 실습

## csv  파일 읽어오기

In [52]:

import pandas as pd

data_frame=pd.read_csv("./연습.csv")

data_frame
# 이런 형태를 판다스 데이터 프레임이라 한다.

#예측 문제라 생각하면, 프라이드가격과 양넘 가격으로 별점 예측하는 문제가 된다.

        house  fried  yangnyum  rate
0         bbq  10000     12000     5
1         kfc  12000     13500     4
2        nene  14000     16500     3
3  ddangddang  15600     19600     2
4     kyochon  20000     22600     1

## 컬럼 조회

In [53]:
data_frame['fried']
#이렇게 조회 된것을 판다스 시리즈라 한다.

0    10000
1    12000
2    14000
3    15600
4    20000
Name: fried, dtype: int64

In [54]:
data_frame['yangnyum']

0    12000
1    13500
2    16500
3    19600
4    22600
Name: yangnyum, dtype: int64

In [55]:
data_frame['rate']

0    5
1    4
2    3
3    2
4    1
Name: rate, dtype: int64

## row 조회

In [56]:
data_frame.loc[0,:]

house         bbq
fried       10000
yangnyum    12000
rate            5
Name: 0, dtype: object

In [57]:
data_frame.loc[1,:]

house         kfc
fried       12000
yangnyum    13500
rate            4
Name: 1, dtype: object

## 상관계수

In [58]:
data_frame.corr()

             fried  yangnyum      rate
fried     1.000000  0.982146 -0.979531
yangnyum  0.982146  1.000000 -0.993601
rate     -0.979531 -0.993601  1.000000

## 조회와 수정

In [50]:
# 문제1. 모든 치킨집 후라이드 가격을 만원으로 통일하라
data_frame['fried']=10000
data_frame

        house  fried  yangnyum  rate
0         bbq  10000     12000     5
1         kfc  10000     13500     4
2        nene  10000     16500     3
3  ddangddang  10000     19600     2
4     kyochon  10000     22600     1

In [59]:

data_frame2=data_frame.copy()
data_frame2

        house  fried  yangnyum  rate
0         bbq  10000     12000     5
1         kfc  12000     13500     4
2        nene  14000     16500     3
3  ddangddang  15600     19600     2
4     kyochon  20000     22600     1

In [61]:
# 문제2. 후라이드 값이 1만 5천원 이상인 지점을 찾아서, 별점 1점 깎아라
data_frame['fried']>=15000

0    False
1    False
2    False
3     True
4     True
Name: fried, dtype: bool

In [62]:
data_frame[data_frame['fried']>=15000]

        house  fried  yangnyum  rate
3  ddangddang  15600     19600     2
4     kyochon  20000     22600     1

In [43]:
data_frame[data_frame['fried']>=15000]['rate']=data_frame[data_frame['fried']>=15000]['rate'].copy()-1
#warning 발생한다.

<ipython-input-43-2325af85659f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_frame[data_frame['fried']>=15000]['rate']=data_frame[data_frame['fried']>=15000]['rate']-1

In [44]:
#실제로도 데이터가 반양 안된다!
data_frame

        house  fried  yangnyum  rate
0         bbq  10000     12000     5
1         kfc  12000     13500     4
2        nene  14000     16500     3
3  ddangddang  15600     19600     2
4     kyochon  20000     22600     1

In [69]:
data_frame[data_frame['fried']>=15000]['rate']=data_frame[data_frame['fried']>=15000]['rate'].copy()
#warning 발생한다.

data_frame

<ipython-input-69-698dec5b5152>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_frame[data_frame['fried']>=15000]['rate']=data_frame[data_frame['fried']>=15000]['rate'].copy()

        house  fried  yangnyum  rate
0         bbq  10000     12000     5
1         kfc  12000     13500     4
2        nene  14000     16500     3
3  ddangddang  15600     19600     2
4     kyochon  20000     22600     1

In [85]:
?pd.DataFrame.where

In [86]:
#where 라는 함수를 이용한다.
#조건에 해당하지 않으면 ,바꾼다.
#15000이하가 아니면, 감소한다.

data_frame['rate'].where(data_frame['fried'] < 15000, data_frame['rate']-1)

0    5
1    4
2    3
3    1
4    0
Name: rate, dtype: int64

In [87]:
data_frame['rate']=data_frame['rate'].where(data_frame['fried'] < 15000, data_frame['rate']-1)

In [88]:
data_frame

        house  fried  yangnyum  rate
0         bbq  10000     12000     5
1         kfc  12000     13500     4
2        nene  14000     16500     3
3  ddangddang  15600     19600     1
4     kyochon  20000     22600     0

## 리스트 to 데이터 프레임

In [30]:
house = ["pericana","hosigi","goobne"]
fried = [20000,15000,25000]
yangnyum = [23000,17500,29000]
rate = [3,4,5]

In [32]:
# 각 리스트를 데이터프레임으로 만들고 옆으로 붙이는 방식
pd.concat([
        pd.DataFrame(house),
        pd.DataFrame(fried),
        pd.DataFrame(yangnyum),
        pd.DataFrame(rate)],axis=1)

          0      0      0  0
0  pericana  20000  23000  3
1    hosigi  15000  17500  4
2    goobne  25000  29000  5

In [33]:
# 각 리스트를 데이터프레임으로 만들고 옆으로 붙이는 방식
df2=pd.concat([
        pd.DataFrame(house),
        pd.DataFrame(fried),
        pd.DataFrame(yangnyum),
        pd.DataFrame(rate)],axis=1)
df2.columns=['house','fried','yangnyum','rate'] #컬럼이름 지정해주기
df2

      house  fried  yangnyum  rate
0  pericana  20000     23000     3
1    hosigi  15000     17500     4
2    goobne  25000     29000     5

## 데이터 프레임 출력

In [89]:
df2.to_csv("./연습2.csv",index=False)